evanjs/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
static const size_t UBICQUIA_OUI_COUNT = sizeof(UBICQUIA_OUIS) / sizeof(UBICQUIA_OUIS[0]);

static const uint8_t MOTOROLA_OUIS[][3] = {
    {0x00, 0x04, 0x7d}, {0x00, 0x18, 0x85}, {0x00, 0x1f, 0x92}, {0x4c, 0xcc, 0x34},
    {0x10, 0x74, 0x6f}, {0xb8, 0xe2, 0x8c}, {0x9c, 0x86, 0x2b},
};
static const size_t MOTOROLA_OUI_COUNT = sizeof(MOTOROLA_OUIS) / sizeof(MOTOROLA_OUIS[0]);

static const uint8_t VERKADA_OUIS[][3] = {
    {0xe0, 0xa7, 0x00},
};
static const size_t VERKADA_OUI_COUNT = sizeof(VERKADA_OUIS) / sizeof(VERKADA_OUIS[0]);

static const uint8_t GENETEC_OUIS[][3] = {
    {0x00, 0xbf, 0x15}, {0x0c, 0xbf, 0x15},
};
static const size_t GENETEC_OUI_COUNT = sizeof(GENETEC_OUIS) / sizeof(GENETEC_OUIS[0]);

static const uint8_t AVIGILON_OUIS[][3] = {
    {0x70, 0x1a, 0xd5},
};
static const size_t AVIGILON_OUI_COUNT = sizeof(AVIGILON_OUIS) / sizeof(AVIGILON_OUIS[0]);

// Utility, Inc "BodyWorn" body cameras. Exclusive MA-L blocks (IEEE 2026-09-07).
// MUST stay byte-identical to utility_ouis[] in helpers/flock_db.c.
static const uint8_t UTILITY_OUIS[][3] = {
    {0x00, 0x09, 0xbc}, {0x00, 0x16, 0xed},
};
static const size_t UTILITY_OUI_COUNT = sizeof(UTILITY_OUIS) / sizeof(UTILITY_OUIS[0]);

// Digital Ally "FirstVU" body/in-car cameras. Exclusive MA-L block.
// MUST stay byte-identical to digitalally_ouis[] in helpers/flock_db.c.
static const uint8_t DIGITALALLY_OUIS[][3] = {
    {0x00, 0x23, 0xbd},
};
static const size_t DIGITALALLY_OUI_COUNT =
    sizeof(DIGITALALLY_OUIS) / sizeof(DIGITALALLY_OUIS[0]);


// ---- Drone manufacturers (24) --------------------------------------------
//
// A FALLBACK to Remote ID, never the main path. Of the five drone vendors a US
// police department realistically buys from -- Skydio, BRINC, Aerodome, Flock,
// Paladin -- only Skydio holds an IEEE block at all, so three of the five cannot
// be matched by any prefix table, ever. The aircraft that matters is found by its
// ASTM F3411 Remote ID broadcast (decoded app-side), which is a
// legal mandate and vendor-independent.
//
// A hit here is NOT a police drone: DJI's blocks are on far more hobbyist
// quadcopters than anything else. It scores like any other bare OUI.
//
// MA-L HOLDERS ONLY. Autel Robotics, Yuneec, Inspired Flight, ideaForge and the
// rest sit inside shared IEEE Registration Authority MA-M/MA-S blocks, and this
// table is three bytes wide, so matching them would flag unrelated hardware as an
// aircraft. Excluded on purpose despite being DJI: f8:40:68 (Ronin gimbals) and
// 20:1f:55 (Osmo handhelds) -- neither flies.
//
// MUST stay byte-identical to drone_ouis[] in helpers/flock_db.c; the CI parity
// gate enforces it. EXACTLY four entries per row.
static const uint8_t DRONE_OUIS[][3] = {
    {0x60, 0x60, 0x1f}, {0x34, 0xd2, 0x62}, {0x48, 0x1c, 0xb9}, {0xe4, 0x7a, 0x2c},
    {0x58, 0xb8, 0x58}, {0x04, 0xa8, 0x5a}, {0x8c, 0x58, 0x23}, {0x0c, 0x9a, 0xe6},
    {0x88, 0x29, 0x85}, {0x4c, 0x43, 0xf6}, {0x9c, 0x5a, 0x8a}, {0xec, 0x72, 0xf7},
    {0x34, 0x91, 0xf0}, {0x38, 0x1d, 0x14}, {0x00, 0x12, 0x1c}, {0x00, 0x26, 0x7e},
    {0x90, 0x03, 0xb7}, {0x90, 0x3a, 0xe6}, {0xa0, 0x14, 0x3d}, {0xb0, 0x30, 0xc8},
    {0x00, 0x1a, 0xf9}, {0x14, 0xdd, 0x48}, {0xec, 0x71, 0x5e}, {0x74, 0xb8, 0x0f},
};
static const size_t DRONE_OUI_COUNT = sizeof(DRONE_OUIS) / sizeof(DRONE_OUIS[0]);

// One row per vendor table, so the index builder and the matcher below cannot
// disagree about which tables exist -- adding a vendor means adding one row here
// and nowhere else. Missing a table in the index builder would make
// oui_first_possible() reject every frame from that vendor before the matcher
// ever ran, and the table would look perfectly correct while detecting nothing.
struct VendorOuiTable {
    const uint8_t (*ouis)[3];
    size_t count;
};
static const VendorOuiTable VENDOR_OUI_TABLES[] = {
    {UBICQUIA_OUIS, UBICQUIA_OUI_COUNT},
    {MOTOROLA_OUIS, MOTOROLA_OUI_COUNT},
    {VERKADA_OUIS, VERKADA_OUI_COUNT},
    {GENETEC_OUIS, GENETEC_OUI_COUNT},
    {AVIGILON_OUIS, AVIGILON_OUI_COUNT},
    {UTILITY_OUIS, UTILITY_OUI_COUNT},
    {DIGITALALLY_OUIS, DIGITALALLY_OUI_COUNT},
    {DRONE_OUIS, DRONE_OUI_COUNT},
};
static const size_t VENDOR_OUI_TABLE_COUNT =
    sizeof(VENDOR_OUI_TABLES) / sizeof(VENDOR_OUI_TABLES[0]);


// ---- State ---------------------------------------------------------------
//
// THREADING. promisc_cb() runs in the WiFi driver task (usually core 0) and
// loop()/handle_command() run in the Arduino task (core 1), so everything they
// share needs `volatile` at minimum, and a critical section wherever a read and
// a write must agree with each other.
//
// g_mux guards the two places where a torn read is not merely inaccurate but
// unsafe or wrong: the beacon ring (whose count BOUNDS an array write) and the
// Locator target (a 6-byte MAC that must be swapped atomically or promisc_cb
// homes on a half-old, half-new address for a few frames).
//
// The frame counters below are deliberately NOT protected. `volatile` does not
// make `++` atomic, so they can lose the odd increment under contention -- but
// they are display-only rate indicators reset every interval, and taking a lock
// per frame inside the WiFi callback would cost more than the drift.
static portMUX_TYPE g_mux = portMUX_INITIALIZER_UNLOCKED;

static volatile bool g_scanning = true;
static volatile uint32_t g_frames = 0;
static volatile uint32_t g_hits = 0;
static volatile uint32_t g_deauths = 0; // deauth + disassoc frames seen (attack indicator)
static volatile uint8_t g_channel = 1;
static uint8_t g_lock_channel = 0; // 0 = hop
/** Highest 2.4 GHz channel the hopper visits. See the hop block in loop(). */
#define MAX_HOP_CHANNEL 13

/* ---- Dual-band (5 GHz) support -------------------------------------------
 *
 * A 2.4-only companion CANNOT SEE a Flock uplink on 5 GHz -- not "sees it
 * weakly", cannot see it at all. The ESP32-C5 is the first Espressif part with a
 * 5 GHz radio, so on that chip we hop both bands.
 *
 * Gated on the SoC capability, not on a board name: SOC_WIFI_SUPPORT_5G comes
 * from the IDF's own soc_caps.h, so a classic ESP32/S3/C3 compiles exactly as
 * before and pays nothing (the 5 GHz table is not even emitted). Requires
 * Arduino core 3.x, which is where the C5 exists at all.
 *
 * Channel list is the 28 20 MHz channels the IDF enumerates for this radio
 * (esp_wifi_types_generic.h). Band switching is done purely by setting the
 * channel: the IDF docs say to prefer esp_wifi_set_channel() over
 * esp_wifi_set_band(), and it moves bands on its own once band mode is AUTO.
 *
 * COST, stated plainly: a full sweep goes from 13 channels to 41. At the same
 * 300 ms dwell that is ~12.3 s per sweep instead of ~3.9 s, so a given camera is
 * revisited a third as often. That is the honest price of covering a band we
 * currently cannot see, and `band 2g` returns the fast sweep for anyone who
 * wants it.
 */
#if defined(SOC_WIFI_SUPPORT_5G) && SOC_WIFI_SUPPORT_5G
#define FLOCK_HAS_5GHZ 1
#else
#define FLOCK_HAS_5GHZ 0
#endif

#if FLOCK_HAS_5GHZ
/** 5 GHz 20 MHz channels, incl. DFS (52-144) -- we only ever listen. */
static const uint8_t CHANNELS_5G[] = {36,  40,  44,  48,  52,  56,  60,  64,  100, 104,
                                      108, 112, 116, 120, 124, 128, 132, 136, 140, 144,
                                      149, 153, 157, 161, 165, 169, 173, 177};
#define CHANNELS_5G_COUNT (sizeof(CHANNELS_5G) / sizeof(CHANNELS_5G[0]))
#endif

/** Which band(s) the hopper sweeps. `band 2g|5g|all` selects at runtime. */
typedef enum {
    FlockBand2G = 0,
    FlockBand5G = 1,
    FlockBandAll = 2,
} FlockBandSel;

/* Default: sweep everything the radio can reach. On a 2.4-only part this is
 * identical to the old behaviour, because the 5 GHz list does not exist. */
#if FLOCK_HAS_5GHZ
static FlockBandSel g_band = FlockBandAll;
#else
static FlockBandSel g_band = FlockBand2G;
#endif

/** Hop cursor: index into the logical (2.4 then 5) channel sequence. */
static uint16_t g_hop_i = 0;

/** True if `ch` is a 5 GHz channel number (2.4 GHz tops out at 14). */
static inline bool is_5ghz_channel(uint8_t ch) {
    return ch >= 36;
}

/** Number of channels in the current sweep. */
static uint16_t hop_count() {
    uint16_t n = 0;
    if(g_band == FlockBand2G || g_band == FlockBandAll) n += MAX_HOP_CHANNEL;
#if FLOCK_HAS_5GHZ
    if(g_band == FlockBand5G || g_band == FlockBandAll) n += CHANNELS_5G_COUNT;
#endif
    return n ? n : MAX_HOP_CHANNEL; // never zero: degrade to 2.4 rather than stall
}

