evanjs/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
static bool ax_oui_match(const uint8_t* mac) {
    if(!oui_first_possible(mac[0])) return false; // fast reject, no table walk
    for(size_t i = 0; i < AXON_OUI_COUNT; i++) {
        if(mac[0] == AXON_OUIS[i][0] && mac[1] == AXON_OUIS[i][1] &&
           mac[2] == AXON_OUIS[i][2])
            return true;
    }
    return false;
}

// Any known surveillance-vendor prefix, any class. Scoring is class-agnostic;
// the class itself rides along in the `cls=` field.
//
// DELIBERATELY EXCLUDES the vendor-exclusive competitor tables. This predicate
// feeds the conf=2 ("likely") probe-request rungs below, and those rungs were
// calibrated against upstream's Flock field test -- 11/12 cameras, 2 false
// positives. Extending them to five vendors whose hardware has never been
// captured on the air would be asserting a measurement nobody has taken.
// vendor_oui_match() below gets its own, lower rung instead.
static bool oui_match(const uint8_t* mac) {
    return flock_oui_match(mac) || st_oui_match(mac) || ax_oui_match(mac);
}

// Vendor-exclusive competitor prefixes -> conf=1 only. See the table comment.
static bool vendor_oui_match(const uint8_t* mac) {
    if(!oui_first_possible(mac[0])) return false; // fast reject, no table walk
    for(size_t t = 0; t < VENDOR_OUI_TABLE_COUNT; t++) {
        const VendorOuiTable& vt = VENDOR_OUI_TABLES[t];
        for(size_t i = 0; i < vt.count; i++) {
            if(mac[0] == vt.ouis[i][0] && mac[1] == vt.ouis[i][1] && mac[2] == vt.ouis[i][2])
                return true;
        }
    }
    return false;
}

static char lc(char c) {
    return (c >= 'A' && c <= 'Z') ? (char)(c + 32) : c;
}

/**
 * True if `s` is EXACTLY "flock-" + 6 hex digits: the provisioning-AP name.
 *
 * Mirrors is_flock_provisioning_ssid() in helpers/flock_db.c -- keep the two in
 * step, same hand-sync rule as the OUI tables above.
 *
 * ANCHORED on purpose. This used to be a bare strstr(buf, "flock-"), which
 * confirmed every benign name that merely contained the substring:
 * "Flock-Guest", "Flock-Safety-Corp", "Flock-12345". The Flipper takes the
 * companion's conf verbatim on this path, so that went straight to the screen
 * as CONFIRMED. Those now fall through to the "likely" check below.
 *
 * `s` is already lower-cased by the caller, so only a-f need testing.
 */
static bool is_flock_provisioning_ssid(const char* s) {
    if(strncmp(s, "flock-", 6) != 0) return false;
    for(int i = 6; i < 12; i++) {
        char c = s[i]; // '\0' on a short SSID is not hex -> correctly rejected
        bool hex = (c >= '0' && c <= '9') || (c >= 'a' && c <= 'f');
        if(!hex) return false;
    }
    return s[12] == '\0'; // nothing may follow the 6 hex digits
}

// Returns: 0 none, 2 likely (flock/flck substring), 3 confirmed
// (^flock-[0-9a-f]{6}$ or the test_flck dev SSID, CVE-2025-59409)
static int ssid_score(const char* s, int len) {
    if(len <= 0) return 0;
    char buf[64];
    int n = len < 63 ? len : 63;
    for(int i = 0; i < n; i++) buf[i] = lc(s[i]);
    buf[n] = 0;
    if(is_flock_provisioning_ssid(buf) || strstr(buf, "test_flck")) return 3;
    if(strstr(buf, "flock") || strstr(buf, "flck")) return 2;
    return 0;
}

// Append up to `max` bytes of `s` into buf[*pos], stripping ',', CR, LF and control chars
// to '.' so the payload can't break the line protocol. Bounds-checked; advances *pos.
// Callers assemble a whole line in one buffer and emit it with a SINGLE Serial.write, so a
// line built in promisc_cb (WiFi task) can't interleave on the UART with loop()'s status
// lines -- a single HardwareSerial::write() is atomic w.r.t. the other task's writes.
static void buf_append_escaped(char* buf, size_t bufsz, size_t* pos, const char* s, int len, int max) {
    for(int i = 0; i < len && i < max && *pos + 1 < bufsz; i++) {
        char c = s[i];
        if(c == ',' || c == '\r' || c == '\n' || (uint8_t)c < 0x20) c = '.';
        buf[(*pos)++] = c;
    }
}

/**
 * Append a printf-formatted field at buf[*pos], clamping to the buffer.
 *
 * snprintf() returns what it WOULD have written, so the natural-looking
 * `pos += snprintf(buf + pos, sizeof(buf) - pos, ...)` overshoots `pos` past the
 * buffer on truncation. The NEXT call then computes `sizeof(buf) - pos` as a
 * size_t UNDERFLOW -- a huge length against an out-of-bounds pointer. Chained
 * appends must never accumulate the raw return value; this clamps instead.
 */
static void buf_appendf(char* buf, size_t bufsz, size_t* pos, const char* fmt, ...) {
    if(*pos + 1 >= bufsz) return; // no room for even one byte + NUL
    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(buf + *pos, bufsz - *pos, fmt, ap);
    va_end(ap);
    if(n < 0) return; // encoding error
    size_t avail = bufsz - *pos - 1;
    *pos += ((size_t)n > avail) ? avail : (size_t)n;
}

// ---- Sustained-probe-rate gate -------------------------------------------
//
// WHY. "Flock OUI + wildcard probe request -> LIKELY" is too generous on its own,
// because a wildcard probe is the most ordinary frame a Wi-Fi client emits: it is
// literally what scanning for a network looks like. And FLOCK_OUIS is mostly chip
// vendors, not Flock -- 21 of its entries are Liteon. So an ordinary consumer
// device built on the same silicon, doing nothing but looking for a network, was
// scoring LIKELY. A user reported exactly that for a T-Mobile hotspot.
//
// THE GATE THIS BUILT WAS REMOVED. Twice it was set to a value that could not be
// demonstrated to pass a camera, and a filter on the primary detection path that
// cannot be shown to pass a true positive is worse than the false positive it
// prevents. What remains is the COUNTER, reported as `pr=<n>`, so a future
// threshold can be derived from measurement instead of from reasoning.
//
// The reasoning was: a fielded camera sprays wildcard probes roughly every 125 ms
// while a phone emits a burst and goes quiet, so rate should separate them. The
// first attempt asked for 3 probes in 2000 ms, which the radio's own duty cycle
// makes impossible -- it watches one channel for 300 ms out of every 3900 ms, so
// a camera can only ever put 2 into one window. The second widened the window to
// span sweeps; on the bench that still produced zero probe-sourced detections
// while beacons from the same board detected fine, and whether the cause was the
// gate or the rig's MAC spoofing was never established.
//
// The reported false positive is addressed where it actually came from: 48:27:ea
// (Samsung) and a4:cf:12 (Espressif) are out of the built-in table.
//
// So: require several probes from the same transmitter inside a short window
// before OUI+probe may reach conf=2. Because the radio only watches any one
// channel for 300 ms at a time, a camera does NOT clear this inside a single
// dwell -- it clears it by still probing on the next sweep, which a phone that
// has finished scanning does not do. See the arithmetic on PROBE_WINDOW_MS.
//
// THRESHOLDS ARE NOT FIELD-TUNED. 125 ms is upstream's figure, but the client-side
// distribution has never been measured here, so these are deliberately loose --
// they are set to catch the reported false positive without risking a real
// camera, not to be optimal. The observed count is reported on the wire as
// `pr=<n>` precisely so it can be tuned from real captures instead of guessed at
// again. Widen the window or lower the threshold only with data.
#define PROBE_TRACK_N   24 // transmitters tracked (LRU); urban scans are busy
// THE WINDOW MUST SPAN SEVERAL CHANNEL SWEEPS. This is not a tuning preference,
// it is arithmetic, and getting it wrong once already shipped a gate that could
// never open:
//
//   channel dwell            300 ms   (the hop below)
//   2.4 GHz sweep     13 x 300 = 3900 ms
//   so any one channel is watched for 300 ms out of every 3900 ms
//   a fielded camera probes every ~125 ms -> 300/125 = 2 probes seen per dwell
//
// v0.74 asked for 3 probes inside 2000 ms. A camera can only ever put 2 into one
// dwell, and consecutive dwells are 3900 ms apart, so two dwells never share a
// 2000 ms window. The threshold was unreachable BY CONSTRUCTION -- not strict,
// impossible -- and it silently disabled the OUI+probe path that finds most
// fielded cameras. Caught by tools/flock_emitter on the bench, which is exactly
// why that rig exists.
//
// What actually separates a camera from a phone at this dwell is PERSISTENCE
// ACROSS SWEEPS, not burst rate inside one. A camera in station mode is probing
// on every single visit, forever. A phone scanning emits a burst and then goes
// quiet for tens of seconds. So the window spans ~2 sweeps and the threshold is
// what a camera accumulates over them:
//
//   camera  ~2 per dwell x 2 dwells in 8000 ms = ~4  -> passes
//   phone    1-2 probes total in one burst          -> blocked
//
// STILL NOT VALIDATED AGAINST A REAL CAMERA. 125 ms is upstream's figure and the
// arithmetic above follows from it; nobody has held this against fielded
// hardware. The observed count rides the wire as `pr=<n>` so it can be measured
// rather than reasoned about a third time.
#define PROBE_WINDOW_MS 8000 // ~2 full channel sweeps, so persistence accumulates
// No PROBE_BURST_MIN any more: nothing thresholds this count. It is reported
// as `pr=<n>` and weighed by a human, which is the only honest use for it
// until someone measures a real camera against a real phone.

struct ProbeTrack {
    uint8_t mac[6];
    uint8_t count;
    uint32_t first_ms;
    uint32_t last_ms;
};
static ProbeTrack g_probe_track[PROBE_TRACK_N];

/**
 * Record one probe request from `mac` and return how many it has sent inside the
 * current window (>= 1). Called on EVERY candidate probe, before the sequence-run
 * coalescer -- the coalescer deliberately suppresses repeats, so counting after it
 * would always see 1 and the gate would reject everything including real cameras.
 */
static uint8_t probe_rate_bump(const uint8_t* mac) {
    uint32_t now = millis();
    int slot = -1, oldest = 0;
    for(int i = 0; i < PROBE_TRACK_N; i++) {
        if(memcmp(g_probe_track[i].mac, mac, 6) == 0 && g_probe_track[i].count) {
            slot = i;
            break;
        }
        // millis() wraps every ~49 days; the subtraction is unsigned so the
        // comparison stays correct across the wrap.
        if((uint32_t)(now - g_probe_track[i].last_ms) >
           (uint32_t)(now - g_probe_track[oldest].last_ms)) {
            oldest = i;
        }
    }
    if(slot < 0) { // evict the least recently used entry
        slot = oldest;
        memcpy(g_probe_track[slot].mac, mac, 6);
        g_probe_track[slot].count = 0;
    }
    ProbeTrack* e = &g_probe_track[slot];
    if(e->count == 0 || (uint32_t)(now - e->first_ms) > PROBE_WINDOW_MS) {
        e->count = 1; // window expired -> start a fresh one
        e->first_ms = now;
    } else if(e->count < 255) {
        e->count++;
    }
    e->last_ms = now;
    return e->count;
}

