evanjs/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
// ---- B1: probe IE-fingerprint + sequence-number coalescer ----------------
//
// The whole OUI/SSID ladder collapses the day Flock randomizes the probe MAC.
// The probe *body* is MAC-independent: the ordered set of tagged Information
// Elements (supported rates, HT/VHT/HE caps, vendor-specific 0xDD OUI+type) is
// baked into the WiFi SoC driver and can't be scrambled without breaking
// 802.11. We hash that skeleton into a uint32 the Flipper compares against a
// curated table. This is a device-CLASS / firmware-stack match, NOT a unique
// device ID -- the Flipper reports it as a candidate class match only.
//
// We hash only the *skeleton* (tag id + length, plus the first OUI+type bytes
// of vendor-specific IEs), never per-frame variable contents, so the same probe
// template hashes identically regardless of the (possibly randomized) MAC.

#define FNV1A_OFFSET 0x811c9dc5u
#define FNV1A_PRIME 0x01000193u

static inline uint32_t fnv1a_u8(uint32_t h, uint8_t b) {
    return (h ^ b) * FNV1A_PRIME;
}

// FNV-1a over the IE skeleton of a probe request. `p` points at the frame body,
// `len` is the body length (FCS already removed). Tagged params start at byte
// 24 (probe request has no fixed params). For each IE we fold in (tag_id,
// length); for vendor-specific (0xDD) we also fold in up to the first 5 bytes
// (3-byte OUI + 1-2 type/subtype) -- enough to distinguish vendor IEs without
// shipping their variable payloads. Returns 0 if there are no parseable IEs.
static uint32_t ie_skeleton_hash(const uint8_t* p, int len) {
    uint32_t h = FNV1A_OFFSET;
    int off = 24; // tagged parameters begin here for a probe request
    bool any = false;
    while(off + 2 <= len) {
        uint8_t tag = p[off];
        uint8_t tlen = p[off + 1];
        if(off + 2 + tlen > len) break; // truncated IE -> stop
        h = fnv1a_u8(h, tag);
        h = fnv1a_u8(h, tlen);
        if(tag == 0xDD) { // vendor-specific: fold OUI + type (first 5 bytes)
            int n = tlen < 5 ? tlen : 5;
            for(int i = 0; i < n; i++) h = fnv1a_u8(h, p[off + 2 + i]);
        }
        any = true;
        off += 2 + tlen;
    }
    return any ? h : 0;
}

// ---- Remote ID over WI-FI (ASTM F3411) -----------------------------------
//
// The BLE path in ble_do_scan() is not the whole story. ASTM F3411 defines FOUR
// broadcast transports -- BLE legacy, BLE extended, Wi-Fi NAN and Wi-Fi Beacon --
// and an aircraft is only required to implement one. DJI in particular favours
// the beacon form, so a BLE-only receiver silently misses whole fleets while
// looking like it is working.
//
// The beacon form is a vendor-specific IE (tag 0xDD) whose OUI is FA:0B:BC with
// vendor type 0x0D, followed by a one-byte counter and then a MESSAGE PACK.
// odid_parse_messages() app-side already handles packs, so once the IE is
// located this is the same decode as BLE.
//
// Walks the IEs itself rather than reusing ie_skeleton_hash(): that one hashes
// and discards, and its start offset is fixed at 24 for probe requests, whereas a
// beacon's tagged parameters begin at 36 after the fixed body.
#define ODID_WIFI_OUI_0 0xFA
#define ODID_WIFI_OUI_1 0x0B
#define ODID_WIFI_OUI_2 0xBC
#define ODID_WIFI_TYPE  0x0D

static const uint8_t* odid_find_wifi_ie(const uint8_t* p, int len, int tag_off, int* out_len) {
    if(!p || !out_len || tag_off < 0) return NULL;
    int off = tag_off;
    while(off + 2 <= len) {
        uint8_t tag = p[off];
        uint8_t tlen = p[off + 1];
        if(off + 2 + tlen > len) break; // truncated IE -> stop, trust nothing
        if(tag == 0xDD && tlen >= 5 && p[off + 2] == ODID_WIFI_OUI_0 &&
           p[off + 3] == ODID_WIFI_OUI_1 && p[off + 4] == ODID_WIFI_OUI_2 &&
           p[off + 5] == ODID_WIFI_TYPE) {
            // Skip the 3-byte OUI, the vendor type and the message counter; what
            // is left is the message pack the app decodes.
            int body = (int)tlen - 5;
            if(body <= 0) return NULL;
            *out_len = body;
            return &p[off + 7];
        }
        off += 2 + tlen;
    }
    return NULL;
}

// ---- PROBE SURVEY --------------------------------------------------------
//
// WHY THIS EXISTS. Field reports (issue #25, and a drive of the maintainer's own)
// show the same picture from different hardware: tens of thousands of management
// frames captured, and ZERO candidates. 83,916 frames over 31 minutes past real
// ALPR cameras, nothing scoring. The radio is fine; nothing in the air matched
// any table we ship.
//
// The detector cannot explain that, because it only ever reports what it already
// recognises. A camera on an OUI we do not know, or one that has moved to MAC
// randomisation -- which this file's own comments warn "collapses the whole
// OUI/SSID ladder" -- is indistinguishable from an empty street.
//
// So this records what is ACTUALLY there: every distinct transmitter sending
// WILDCARD probe requests, matched or not, with its IE-skeleton fingerprint. Park
// next to a camera you can see, and the row with a large count and a stable
// fingerprint is the camera -- whatever its OUI turns out to be. That is how the
// OUI table gets extended and how flock_ie_fps[] finally gets populated, which is
// the designed answer to randomised MACs and currently ships empty.
//
// Wildcard probes only: a directed probe names a network the device already
// knows, which is ordinary client behaviour and would bury the table in phones.
// Phones still appear -- they scan too -- but a phone emits a burst and stops
// while a camera probes every ~125 ms forever, so COUNT is the discriminator.
//
// Costs nothing when unused: rows are kept in RAM and only leave the board when
// the app asks with `survey`. No extra UART traffic during normal detection.
#define SURVEY_MAX 32
typedef struct {
    uint8_t mac[6];
    uint32_t fp; /**< IE-skeleton hash; survives MAC randomisation */
    int8_t rssi; /**< strongest seen -- closest approach */
    uint8_t ch;
    uint16_t count;
    bool used;
} SurveyRow;
static SurveyRow g_survey[SURVEY_MAX];

static void survey_note(const uint8_t* mac, uint32_t fp, int8_t rssi, uint8_t ch) {
    int free_slot = -1, weakest = -1;
    for(int i = 0; i < SURVEY_MAX; i++) {
        if(!g_survey[i].used) {
            if(free_slot < 0) free_slot = i;
            continue;
        }
        if(memcmp(g_survey[i].mac, mac, 6) == 0) {
            if(g_survey[i].count < 0xFFFF) g_survey[i].count++;
            if(rssi > g_survey[i].rssi) g_survey[i].rssi = rssi; // closest approach
            g_survey[i].ch = ch;
            if(fp) g_survey[i].fp = fp;
            return;
        }
        // Evict the LEAST seen, never the most: a persistent emitter is the one
        // worth keeping, and it is the one a camera produces.
        if(weakest < 0 || g_survey[i].count < g_survey[weakest].count) weakest = i;
    }
    int slot = (free_slot >= 0) ? free_slot : weakest;
    if(slot < 0) return;
    memset(&g_survey[slot], 0, sizeof(SurveyRow));
    memcpy(g_survey[slot].mac, mac, 6);
    g_survey[slot].fp = fp;
    g_survey[slot].rssi = rssi;
    g_survey[slot].ch = ch;
    g_survey[slot].count = 1;
    g_survey[slot].used = true;
}

