evanjs/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
/** Stream the survey to the app. One line per transmitter, strongest first. */
static void survey_dump() {
    Serial.print("SVBEGIN\n");
    int n = 0;
    for(int i = 0; i < SURVEY_MAX; i++) {
        if(!g_survey[i].used) continue;
        Serial.printf(
            "SV,%02x%02x%02x%02x%02x%02x,%d,%u,%08lx,%u\n",
            g_survey[i].mac[0],
            g_survey[i].mac[1],
            g_survey[i].mac[2],
            g_survey[i].mac[3],
            g_survey[i].mac[4],
            g_survey[i].mac[5],
            g_survey[i].rssi,
            g_survey[i].ch,
            (unsigned long)g_survey[i].fp,
            (unsigned)g_survey[i].count);
        n++;
    }
    Serial.printf("SVEND,%d\n", n);
}

// Sequence-number-run coalescer. A MAC-cycling Flock burst sprays many probes
// from different (randomized) MACs but with a *contiguous* 802.11 sequence
// number run -- the SoC's seq counter increments across the burst regardless of
// the source address. We treat such a run as ONE logical sighting and suppress
// the duplicates on the ESP side so they never flood the Flipper's 64-entry
// table. Keyed on the IE-skeleton hash so unrelated traffic with nearby seq
// numbers isn't merged.
#define SEQ_RUN_GAP 4 // max seq-num step to still count as the same burst
#define SEQ_RUN_MS 1500 // a run older than this is stale; start fresh
static uint32_t g_seq_fp = 0; // IE hash of the current run (0 = none)
static uint16_t g_seq_last = 0; // last 802.11 sequence number in the run
static uint32_t g_seq_t = 0; // millis() of the last frame in the run

// Returns true if this frame should be SUPPRESSED as a duplicate within an
// in-progress MAC-cycling burst (same IE fingerprint, monotonic seq-num run).
static bool seq_run_duplicate(uint32_t fp, uint16_t seq) {
    if(fp == 0) return false; // no fingerprint -> can't coalesce
    uint32_t now = millis();
    bool fresh = (now - g_seq_t) <= SEQ_RUN_MS;
    if(fresh && fp == g_seq_fp) {
        uint16_t step = (uint16_t)(seq - g_seq_last); // wraps mod 4096 naturally
        if(step != 0 && step <= SEQ_RUN_GAP) {
            g_seq_last = seq; // extend the run, suppress this frame
            g_seq_t = now;
            return true;
        }
    }
    // New run (or a gap too large / stale): this frame is the run's first
    // sighting -> report it and start tracking from here.
    g_seq_fp = fp;
    g_seq_last = seq;
    g_seq_t = now;
    return false;
}

static void promisc_cb(void* buf, wifi_promiscuous_pkt_type_t type) {
    if(type != WIFI_PKT_MGMT) return;
    const wifi_promiscuous_pkt_t* pkt = (const wifi_promiscuous_pkt_t*)buf;
    const uint8_t* p = pkt->payload;
    // sig_len includes the 4-byte FCS; drop it so SSID bounds checks stay inside
    // the actual frame body.
    int len = pkt->rx_ctrl.sig_len;
    if(len < 28) return;
    len -= 4;

    // Snapshot the channel now: the hopper may advance before we finish.
    uint8_t frame_channel = g_channel;

    g_frames++;

    uint8_t subtype = (p[0] >> 4) & 0x0F;

    // Active-attack rate sampling (counted on EVERY frame, before any Flock
    // candidacy filtering): probe-request floods and beacon-spam (many distinct
    // beaconing BSSIDs). Flushed/evaluated in the ~1 Hz status block.
    if(subtype == 0x04) {
        g_probe_reqs++; // probe request
    } else if(subtype == 0x08) {
        note_beacon_bssid(p + 16); // beacon: addr3 = BSSID
    }

    // Locator (Wi-Fi): track the strongest RSSI of any frame to/from the target
    // MAC (addr1/2/3). loop() emits it as a throttled LOC line.
    if(g_locate_kind == 'w') {
        int r = pkt->rx_ctrl.rssi;
        if(memcmp(p + 4, g_locate_mac, 6) == 0 || memcmp(p + 10, g_locate_mac, 6) == 0 ||
           memcmp(p + 16, g_locate_mac, 6) == 0) {
            if(r > g_locate_best) g_locate_best = r;
        }
    }

    // Deauthentication (0x0C) / disassociation (0x0A) frames: a flood of these
    // is the signature of a deauth attack or an evil-twin kicking clients off.
    if(subtype == 0x0C || subtype == 0x0A) {
        g_deauths++;
        // Attribution: report the targeted BSSID (addr3) + channel, rate-limited
        // so a heavy flood can't saturate the UART.
        uint32_t now_da = millis();
        if(now_da - g_last_da >= 250) {
            g_last_da = now_da;
            const uint8_t* b = p + 16; // addr3 = BSSID
            Serial.printf(
                "DA,%02x%02x%02x%02x%02x%02x,%u\n",
                b[0], b[1], b[2], b[3], b[4], b[5], frame_channel);
        }
    }

    char ftype = 'O';
    const char* ssid = NULL;
    int ssid_len = 0;

    // Locate SSID element (tag 0) within tagged parameters.
    int tag_off = -1;
    if(subtype == 0x04) { // probe request
        ftype = 'P';
        tag_off = 24;
    } else if(subtype == 0x08) { // beacon
        ftype = 'B';
        tag_off = 36;
    } else if(subtype == 0x05) { // probe response
        ftype = 'R';
        tag_off = 36;
    }
    bool ssid_ie_found = false;
    if(tag_off >= 0 && tag_off + 2 <= len && p[tag_off] == 0x00) {
        ssid_ie_found = true;
        ssid_len = p[tag_off + 1];
        if(tag_off + 2 + ssid_len <= len) {
            ssid = (const char*)(p + tag_off + 2);
        } else {
            // The IE claims more bytes than the frame holds -- a truncated or
            // malformed capture. Retract the whole finding, don't just zero the
            // length: leaving ssid_ie_found set made the all-NUL scan below pass
            // vacuously (zero bytes to disagree with it) and every truncated
            // frame got reported as a hidden network. A parse miss is not
            // evidence of concealment.
            ssid_ie_found = false;
            ssid_len = 0;
        }
    }

    // Hidden-SSID beaconing: an AP that advertises but withholds its name. Two
    // encodings are legal and both appear in the wild -- a zero-length SSID IE,
    // and a length-N IE of all NULs -- so test for both.
    //
    // Only meaningful for beacons and probe RESPONSES: those identify an AP. A
    // probe REQUEST with no SSID is an ordinary wildcard scan from a client and
    // says nothing about hiding. And we only claim "hidden" when the SSID IE was
    // actually located: a parse miss is not evidence of concealment.
    bool hidden = false;
    if(ssid_ie_found && (subtype == 0x08 || subtype == 0x05)) {
        hidden = true;
        for(int i = 0; i < ssid_len; i++) {
            if(ssid[i] != '\0') {
                hidden = false;
                break;
            }
        }
    }

    // REMOTE ID OVER WI-FI. Checked on beacons and probe responses, before the
    // Flock scoring ladder and independently of it: an aircraft is not a camera
    // and must not be scored as one. Same RID line as the BLE path, so the app
    // decodes both with the one host-tested decoder.
    if(subtype == 0x08 || subtype == 0x05) {
        int rid_len = 0;
        const uint8_t* rid = odid_find_wifi_ie(p, len, tag_off, &rid_len);
        if(rid) {
            if(rid_len > 64) rid_len = 64;
            char rl[176];
            size_t rp = snprintf(
                rl,
                sizeof(rl),
                "RID,%02x%02x%02x%02x%02x%02x,%d,0d00",
                p[10],
                p[11],
                p[12],
                p[13],
                p[14],
                p[15],
                pkt->rx_ctrl.rssi);
            // The app's parser expects the BLE framing (application code then a
            // counter) before the messages, so the two transports converge on one
            // wire format and one decoder. Synthesised here rather than teaching
            // the app a second shape.
            for(int j = 0; j < rid_len && rp + 2 < sizeof(rl); j++) {
                buf_appendf(rl, sizeof(rl), &rp, "%02x", rid[j]);
            }
            if(rp > sizeof(rl) - 1) rp = sizeof(rl) - 1;
            rl[rp++] = '\n';
            Serial.write((const uint8_t*)rl, rp);
        }
    }

