evanjs/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
    int s_score = ssid ? ssid_score(ssid, ssid_len) : 0;
    bool oui_tx = oui_match(p + 10); // addr2 = transmitter
    bool oui_rx = oui_match(p + 4); // addr1 = receiver (silent station)
    // Vendor-exclusive competitor prefixes, tracked separately because they earn
    // a different (lower) rung than the Flock tables -- see the ladder below.
    bool ven_tx = vendor_oui_match(p + 10);
    bool ven_rx = vendor_oui_match(p + 4);
    bool is_probe = (ftype == 'P');
    bool wildcard = is_probe && (ssid_len == 0); // broadcast/wildcard probe

    // Count this probe against its transmitter BEFORE the coalescer downstream
    // suppresses repeats. Only the transmitter is rate-tracked: on an oui_rx hit
    // the frame was sent TO the Flock-OUI device by someone else, so the cadence
    // belongs to that someone else and says nothing about the receiver.
    // Counted for REPORTING ONLY -- see the note on probe_rate_bump(). This used
    // to gate the OUI+probe rungs below; it does not any more.
    // SURVEY: record every wildcard-probe emitter, matched or not. Deliberately
    // BEFORE the scoring ladder, because the whole point is to see the devices
    // the ladder rejects -- a camera on an OUI we do not carry, or one using a
    // randomised MAC, is invisible everywhere else.
    if(is_probe && wildcard) {
        survey_note(p + 10, ie_skeleton_hash(p, len), pkt->rx_ctrl.rssi, frame_channel);
    }

    uint8_t probe_rate = 0;
    if(is_probe) probe_rate = probe_rate_bump(p + 10); // addr2 = transmitter

    int conf = 0;
    if(s_score == 3)
        conf = 3; // confirmed Flock SSID name
    else if(oui_tx && wildcard)
        conf = 2; // OUI + wildcard probe -> "likely". FLOCK_OUIS is mostly shared
                  // silicon-vendor ranges, so reserve conf=3 for an SSID-name or
                  // IE-fp match. This is what upstream runs, and what its field
                  // test measured at 11/12 cameras with 2 false positives.
    else if(oui_tx && is_probe)
        conf = 2; // same for a directed probe from the OUI device itself
    else if(oui_rx && is_probe)
        conf = 2; // OUI on the SILENT RECEIVER: a frame addressed to a Flock-OUI
                  // device by some other station. Deliberately NOT rate-gated --
                  // the rate would be the sender's, not this device's, and this is
                  // upstream's key technique for catching a dormant camera that is
                  // not transmitting at all. Narrower and rarer than the tx paths.
    else if(s_score == 2)
        conf = 2;
    else if(ven_tx || ven_rx)
        conf = 1; // VENDOR-EXCLUSIVE OUI, any frame type -> "possible".
                  //
                  // THE ONE BARE-OUI RUNG THAT SURVIVES, AND ONLY FOR THESE
                  // TABLES. Read the next comment block first: bare-OUI scoring
                  // was removed because FLOCK_OUIS is mostly Liteon/Espressif,
                  // so "beacons, and has one of these OUIs" described a huge
                  // population of ordinary consumer devices and reported a
                  // T-Mobile gateway as a possible camera.
                  //
                  // That reasoning does not transfer. 94:7b:be is registered to
                  // Ubicquia, who make streetlight nodes and nothing else;
                  // e0:a7:00 is Verkada's own. There is no consumer population
                  // hiding behind these prefixes to generate the false positives
                  // that killed the Flock version of this rung.
                  //
                  // Nor is a beacon disqualifying here the way it is for Flock.
                  // A Flock camera is a station that does not beacon, so an OUI
                  // hit on a beacon is by construction not one. A Ubicquia UbiHub
                  // IS an access point -- beaconing is its normal behaviour --
                  // so requiring probe-request behaviour would reject the very
                  // frames this table exists to catch.
                  //
                  // Capped at 1 and never promoted: registry-verified is not
                  // field-observed, and no unit of this hardware has been seen on
                  // the air. The Flipper names the VENDOR from the same tables,
                  // so the operator gets "Ubicquia streetlight / Possible"
                  // rather than a mystery -- an attributable lead to go verify by
                  // eye, which is all a "possible" was ever meant to be.
    // NO conf=1 FOR A BARE OUI MATCH ANY MORE -- for FLOCK_OUIS, that is.
    //
    // A Flock camera is not an access point. Flock's management AP was
    // deactivated around December 2025 and the cameras moved to station mode --
    // they now emit wildcard PROBE REQUESTS roughly every 125 ms and do not
    // beacon (see the upstream flock-you research this OUI list comes from).
    // So an OUI hit on a BEACON is, by construction, not a camera. It is some
    // other product built on the same silicon.
    //
    // And this list is mostly shared silicon-vendor ranges -- Espressif, Liteon
    // and friends -- so "beacons, and has one of these OUIs" describes an
    // enormous number of ordinary consumer devices. It reported a T-Mobile
    // gateway (SSID "tmobile-5416") as a possible ALPR camera, which is exactly
    // the failure this project says it will not accept: a false positive is
    // worse than a missed detection.
    //
    // Nothing real is lost. Anything that IS a camera still reaches conf=2 via
    // the probe-request branches above, and conf=3 via an SSID name or IE
    // fingerprint. The only sightings dropped are OUI-only ones with no probe
    // behaviour and no name -- which is precisely the set that cannot be
    // distinguished from an unrelated device sharing a chip vendor.

    if(conf == 0) return; // not a candidate; drop to keep UART quiet

    // B1: fingerprint the probe body (MAC-independent device-class signature)
    // and coalesce MAC-cycling bursts via the 802.11 sequence-number run, so a
    // randomized-MAC spray collapses to one logical sighting before it can flood
    // the Flipper's 64-entry table. Only probe requests carry a meaningful IE
    // skeleton. The coalescer runs only on candidate frames so unrelated noise
    // can't capture the run slot and suppress a real detection.
    uint32_t ie_fp = 0;
    if(is_probe) {
        ie_fp = ie_skeleton_hash(p, len);
        // 802.11 sequence control: bytes 22-23, seq number is the top 12 bits.
        uint16_t seq = ((uint16_t)p[23] << 8 | p[22]) >> 4;
        if(seq_run_duplicate(ie_fp, seq)) return; // duplicate in an active burst
    }

