evanjs/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
    g_hits++;
    if(!g_scanning) return;

    // Report the Flock device's MAC: the transmitter if it matched, else the
    // silent receiver (addr1).
    const uint8_t* mac = (oui_tx || ven_tx) ? (p + 10) : ((oui_rx || ven_rx) ? (p + 4) : (p + 10));

    char macstr[13];
    snprintf(
        macstr,
        sizeof(macstr),
        "%02x%02x%02x%02x%02x%02x",
        mac[0],
        mac[1],
        mac[2],
        mac[3],
        mac[4],
        mac[5]);

    // Build the whole D-line in one buffer + single write: promisc_cb runs in the WiFi
    // task, so a multi-call line could be split on the UART by loop()'s status lines.
    char line[160];
    size_t pos =
        snprintf(line, sizeof(line), "D,%s,%d,%u,%c,%d,", macstr, pkt->rx_ctrl.rssi, frame_channel, ftype, conf);
    if(ssid && ssid_len > 0) buf_append_escaped(line, sizeof(line), &pos, ssid, ssid_len, 48);
    // B1: trailing IE-fingerprint field (probe requests only). Older parsers
    // ignore it; the Flipper matches it against a curated Flock IE-fp table.
    if(ie_fp != 0) buf_appendf(line, sizeof(line), &pos, ",fp=%08x", ie_fp);
    // Device class. Only emitted for the non-default (acoustic) case: absent
    // means ALPR, so the wire stays unchanged for every existing detection and
    // an older Flipper build just ignores the token.
    if(probe_rate) buf_appendf(line, sizeof(line), &pos, ",pr=%u", (unsigned)probe_rate);
    if(st_oui_match(mac)) buf_appendf(line, sizeof(line), &pos, ",cls=a");
    else if(ax_oui_match(mac)) buf_appendf(line, sizeof(line), &pos, ",cls=x");
    // cls=g: vendor-exclusive competitor gear. Vendor known, KIND not -- these
    // OUIs carry plate readers, building cameras and hand-held radios alike, so
    // claiming "ALPR" would invent a detection. The Flipper names the vendor
    // from its own copy of these tables.
    else if(vendor_oui_match(mac)) buf_appendf(line, sizeof(line), &pos, ",cls=g");
    // Hidden-SSID attribute. Rides on a line we were already sending, so it adds
    // no UART traffic and needs no per-BSSID dedup of its own. Reported, NOT
    // scored: see the note in helpers/esp_parser.c.
    if(hidden) buf_appendf(line, sizeof(line), &pos, ",hid=1");
    if(pos > sizeof(line) - 1) pos = sizeof(line) - 1;
    line[pos++] = '\n';
    Serial.write((const uint8_t*)line, pos);
}

static void set_channel(uint8_t ch) {
    g_channel = ch;
    esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE);
}

static void start_promisc() {
    wifi_promiscuous_filter_t filter = {.filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT};
    esp_wifi_set_promiscuous_filter(&filter);
    esp_wifi_set_promiscuous_rx_cb(&promisc_cb);
    esp_wifi_set_promiscuous(true);
    set_channel(g_channel);
}

/**
 * The companion's own BUILD version, distinct from the wire-protocol version.
 *
 * WHY BOTH. "FLOCKCO,1" is the PROTOCOL version -- it answers "can these two
 * talk". It does not answer "which firmware is on this board", and until now
 * nothing did: the only label a flashed companion had was the filename of the
 * .bin somebody picked on the SD card, which cannot be verified after the fact
 * and is routinely wrong. One card here held companion_forensic.bin,
 * companion_gatefix.bin, companion_survey.bin and companion_ungated.bin -- none
 * of which say which build they are -- alongside companion_v073/v077/v087, whose
 * labels nobody can check.
 *
 * That is not cosmetic. A whole hardware validation session was run against a
 * companion nobody could identify, and the app's CLAUDE.md carries a HARD RULE
 * about the same failure on the Flipper side (redeploy after a version bump,
 * because the .fap reports the old version while running the new code). This is
 * that rule's missing half.
 *
 * MUST equal FAP_VERSION in application.fam: the two halves are built, flashed
 * and tested as a pair, and a companion left over from a different release is
 * precisely what this exists to expose. tools/check_oui_parity.py fails CI if
 * they drift.
 */
#define FLOCK_COMPANION_VERSION "0.95"

static void banner() {
    // Third field is the BUILD version. Appending is wire-safe: an older app
    // splits this line with max=2, so esp_split_fields() glues "1,0.88" into one
    // field and atoi() still reads 1 as the protocol version. It sees no change.
    Serial.print("FLOCKCO,1," FLOCK_COMPANION_VERSION "\n");
    // What this chip actually is, so the app stops offering a classic ESP32's
    // pinout on every board. Sent as its own line rather than appended to the
    // banner: an older app ignores lines it does not know, but a changed banner
    // would trip its wire-protocol version check.
    //   CHIP,<target>,<gpio_count>,<usable_gps_pin_mask_hi>,<lo>,<has5g>
    uint64_t m = gps_usable_mask();
    Serial.printf(
        "CHIP,%s,%d,%08lx,%08lx,%d\n",
        CONFIG_IDF_TARGET,
        (int)SOC_GPIO_PIN_COUNT,
        (unsigned long)(m >> 32),
        (unsigned long)(m & 0xFFFFFFFFULL),
        FLOCK_HAS_5GHZ);
}

// One-shot WiFi security scan for the FlipDeFlock audit. Switches out of
// promiscuous Flock mode, runs an active esp_wifi_scan (which yields the auth
// mode + ciphers + WPS that Marauder never emits over serial), streams one
// "W," line per AP, then restores Flock promiscuous mode.
//   W,<bssid>,<rssi>,<ch>,<authmode>,<pairwise>,<group>,<wps>,<ssid>
static void wifi_security_scan() {
    esp_wifi_set_promiscuous(false);
    esp_wifi_set_mode(WIFI_MODE_STA);
    esp_wifi_start();

    wifi_scan_config_t sc = {};
    sc.show_hidden = true;
    sc.scan_type = WIFI_SCAN_TYPE_ACTIVE;

    Serial.print("WBEGIN\n");
    uint16_t num = 0;
    if(esp_wifi_scan_start(&sc, true) == ESP_OK) {
        esp_wifi_scan_get_ap_num(&num);
        if(num > 64) num = 64;
        wifi_ap_record_t* recs =
            (wifi_ap_record_t*)malloc(sizeof(wifi_ap_record_t) * (num ? num : 1));
        if(recs) {
            uint16_t got = num;
            if(esp_wifi_scan_get_ap_records(&got, recs) == ESP_OK) {
                for(uint16_t i = 0; i < got; i++) {
                    wifi_ap_record_t* r = &recs[i];
                    char bss[13];
                    snprintf(
                        bss,
                        sizeof(bss),
                        "%02x%02x%02x%02x%02x%02x",
                        r->bssid[0], r->bssid[1], r->bssid[2],
                        r->bssid[3], r->bssid[4], r->bssid[5]);
                    char line[160];
                    size_t pos = snprintf(
                        line, sizeof(line), "W,%s,%d,%u,%d,%d,%d,%d,",
                        bss, r->rssi, r->primary, (int)r->authmode,
                        (int)r->pairwise_cipher, (int)r->group_cipher, r->wps ? 1 : 0);
                    const char* s = (const char*)r->ssid;
                    int sl = 0;
                    while(sl < 32 && s[sl]) sl++; // r->ssid is NUL-terminated
                    buf_append_escaped(line, sizeof(line), &pos, s, sl, 32);
                    if(pos > sizeof(line) - 1) pos = sizeof(line) - 1;
                    line[pos++] = '\n';
                    Serial.write((const uint8_t*)line, pos);
                }
            }
            free(recs);
        }
    }
    Serial.printf("WEND,%u\n", num);

    // Back to Flock detection.
    esp_wifi_set_mode(WIFI_MODE_NULL);
    start_promisc();
}

// One-shot BLE scan for the anti-tracker / BLE-Flock feature. Stops WiFi to free
// the radio, active-scans a few seconds, classifies each device, then restores
// WiFi/Flock mode.
//   BLE,<addr>,<rssi>,<cat>,<company>,<name>[,<mfghex>][,rv=1][,sep=1]
//   cat: 0 unknown  1 Flock/Raven  2 AirTag/FindMy  3 Tile  4 SmartTag  7 Axon
//   mfghex: raw manufacturer-specific data as hex (Flock 0x09C8 only), so the
//   Flipper can decode the device serial; trailing field, older parsers ignore.
//   rv=1: device exposed a Raven-specific GATT service (0x3100-0x3500) -> a
//   positive Raven (acoustic sensor) ID. Emitted AFTER mfghex when both apply;
//   contains '=' so the Flipper tells it apart from mfghex. Older parsers ignore.
//   sep=1: Apple Find My tracker was in separated-state payload form. This is
//   an indicator only; the app still requires repeated sightings over distance.
static void ble_action_emit(const char* op, const char* status, int rssi, bool have_rssi) {
    if(have_rssi)
        Serial.printf("ACT,%s,%s,%d\n", op, status, rssi);
    else
        Serial.printf("ACT,%s,%s\n", op, status);
}

#if FLOCK_HAS_BLE

static void ble_ensure_init() {
    if(g_ble_inited) return;
    BLEDevice::init("");
    g_ble = BLEDevice::getScan();
    g_ble->setActiveScan(true);
    g_ble->setInterval(80); // interval > window so BLE doesn't hog the radio
    g_ble->setWindow(60);
    g_ble_inited = true;
}

// Serialised BLE scan: toggles WiFi promiscuous OFF for the scan, then back ON
// (BLE stays resident). Classifies Flock/Raven by mfg id 0x09C8, device name
// (Penguin* / FS Ext Battery), Raven custom service UUIDs (0x3100-0x3500), or a
// Flock OUI on the BLE address; plus validated AirTag/Tile/SmartTag. Emits
// BBEGIN/BLE/BEND. Weak tracker adverts below BLE_TRACKER_MIN_RSSI are omitted:
// they are not useful evidence that a tag is travelling with the operator.
// Defined further down with the BLE action helpers, but needed by the Raven GATT
// check below: it iterates EVERY advertised service UUID, which is the whole
// point -- the singular accessor missed Ravens that list 0x3100 second.
static bool ble_action_has_service(BLEAdvertisedDevice& d, const char* token);

// "FS-" + EXACTLY six hex digits and nothing else -- Flock's post-"Penguin" unit
// id. Mirrors is_fs_unit_name() in helpers/flock_ble.c byte for byte.
//
// Shaped rather than a bare "FS-" prefix on purpose: two letters and a dash is
// not evidence, and this classification reaches the app as cat=1, which its BLE
// path can only score Confirmed or Possible -- there is no Likely rung to demote
// into. Same reasoning that keeps a loose "flock" substring off this path.
static bool ble_name_is_fs_unit(const std::string& nm) {
    if(nm.size() != 9) return false;
    if(!((nm[0] == 'F' || nm[0] == 'f') && (nm[1] == 'S' || nm[1] == 's') && nm[2] == '-')) {
        return false;
    }
    for(size_t i = 3; i < 9; i++) {
        if(!isxdigit((unsigned char)nm[i])) return false;
    }
    return true;
}


/**
 * True if the raw advertising payload contains the ASCII tag "BWCDEVICE".
 *
 * Axon body-worn cameras carry this in their BLE service data. It is a
 * MAC-INDEPENDENT, positive identification of a body camera specifically, rather
 * than "some device on Axon's OUI" -- which is all a prefix match can ever say,
 * and which is worth much less now that address randomisation is routine.
 *
 * Searched across the WHOLE payload rather than inside a parsed service-data
 * element on purpose. The tag is a fixed nine-byte ASCII string with no ordinary
 * meaning, so a substring hit is already specific; parsing the exact element
 * would add a second thing to get wrong for no gain in precision. It is scored
 * app-side, where it can be weighed against the OUI rather than replacing it.
 *
 * Corroboration: field-validated 2026-07-19 by soyboi1312/all-cameras-are-beacons,
 * which scores it 90 against 75 for the bare Axon OUI. We hold 00:25:df already;
 * this is the tell that says WHAT the device is.
 */
static bool ble_str_has_bwc(const std::string& s) {
    return s.find("BWCDEVICE") != std::string::npos;
}

