evanjs/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
static void ble_do_scan(int seconds) {
    ble_ensure_init();
    esp_wifi_set_promiscuous(false);

    Serial.print("BBEGIN\n");
    if(seconds < 1) seconds = 1;

    // Run the scan as 1-second slices, draining the GPS between each.
    //
    // BLEScan::start() blocks, so one 3 s call also stops loop() for 3 s -- and
    // loop() is what empties Serial1. At 9600 baud that is ~2.9 KB of NMEA
    // arriving against the RX buffer, so sentences were dropped outright; even
    // the survivors left the fix up to ~4 s old. At 50 km/h a 4 s old fix
    // geotags a camera ~55 m from where it really is, which is worse than
    // useless on a DeFlock submission.
    //
    // is_continue = true keeps the library's accumulated results, so total
    // dwell, dedup and the reported device list are preserved. Not quite free:
    // each slice restarts GAP scanning, so a few milliseconds of advert time is
    // lost per boundary (two boundaries at the default 3 s). BLE advertisers
    // repeat every 20-100 ms, so that is far below the noise floor of whether a
    // given device is seen at all -- and a fix that is 1 s old instead of 4 s is
    // worth much more than those milliseconds.
    //
    // 1 s is the floor because start() takes whole seconds.
    for(int i = 0; i < seconds - 1; i++) {
        FLOCK_SCAN_CONT(g_ble, 1, i > 0);
        gps_poll();
    }
    // Last slice returns the accumulated results. is_continue only when earlier
    // slices actually ran, so a 1-second scan still starts from a clean list.
    BLEScanResults found = FLOCK_SCAN_CONT(g_ble, 1, seconds > 1);
    gps_poll();
    int count = found.getCount();
    if(count > 80) count = 80;
    int spam = 0; // impersonation/pairing adverts -> BLE-spam flood indicator
    for(int i = 0; i < count; i++) {
        BLEAdvertisedDevice d = found.getDevice(i);

        int company = -1;
        int cat = 0;
        int rssi = d.getRSSI();
        bool tracker_separated = false;
        // raven: set when this device exposes a Raven-specific GATT service
        // (0x3100-0x3500). Tracked separately from cat because cat=1 also covers
        // the shared battery / Penguin / OUI cases -- only the GATT match is a
        // positive Raven (acoustic) ID, so we surface it as its own rv=1 field.
        bool raven = false;
        if(d.haveManufacturerData()) {
            std::string md = fstr(d.getManufacturerData());
            if(md.length() >= 2) company = (uint8_t)md[0] | ((uint8_t)md[1] << 8);
            if(company == 0x09C8) {
                cat = 1; // Flock Safety / Raven
            } else if(company == 0x034D) {
                // Axon Enterprise, filed with the SIG under their former name
                // TASER International. Its own category, NOT Flock's: the two are
                // unrelated vendors and merging them would have the app report a
                // body camera as Flock hardware.
                cat = 7;
            } else if(company == APPLE_FIND_MY_COMPANY_ID) {
                AppleFindMyAdvert advert;
                if(apple_find_my_decode(
                       (const uint8_t*)md.data(), md.size(), &advert) &&
                   apple_find_my_is_tracker(&advert)) {
                    cat = BLE_TRACKER_CAT_AIRTAG; // AirTag / licensed Find My accessory
                    tracker_separated = advert.separated;
                }
            }
        }
        if(cat != 1 && d.haveName()) {
            std::string nm = fstr(d.getName());
            // MUST stay in step with flock_ble_name_is_flock() in
            // helpers/flock_ble.c, which is where the app re-derives confidence.
            // Anything this side misses reaches the Flipper as cat=0 and is never
            // reconsidered, so a name only the app knows about is a name that
            // finds nothing.
            if(nm.rfind("Penguin", 0) == 0 || nm.find("FS Ext") != std::string::npos ||
               nm.rfind("Pigvision", 0) == 0 || nm.rfind("FlockCam", 0) == 0 ||
               nm.rfind("RWLS-", 0) == 0 || ble_name_is_fs_unit(nm))
                cat = 1; // Flock Penguin battery / FS external battery / field-observed names
        }
        if(d.haveServiceUUID()) {
            std::string u = fstr(d.getServiceUUID().toString());
            // RAVEN GATT: check EVERY advertised service UUID, not just the first.
            //
            // This used to read only getServiceUUID() -- the singular accessor,
            // index 0 -- so a Raven advertising 0x3100 anywhere but first was
            // missed outright: no cat=1, no rv=1, no detection, no alert. A
            // silent recall hole against real hardware, and the one bug in this
            // sweep that costs whole devices rather than a rung.
            //
            // ble_action_has_service() below already iterates the full list with
            // the same substring semantics, and is already compiling on both core
            // 2.0.x and 3.x, so the multi-UUID API is proven available. Substring
            // matching is kept exactly as it was: anchoring would be a recall
            // change, which is out of scope here.
            if(ble_action_has_service(d, "00003100") ||
               ble_action_has_service(d, "00003200") ||
               ble_action_has_service(d, "00003300") ||
               ble_action_has_service(d, "00003400") ||
               ble_action_has_service(d, "00003500")) {
                cat = 1; // Raven custom GATT services
                raven = true; // Raven-specific GATT -> positive acoustic-sensor ID
            }
            else if(cat == 0 && (u.find("feed") != std::string::npos || u.find("feec") != std::string::npos))
                cat = 3; // Tile
            else if(cat == 0 && u.find("fd5a") != std::string::npos)
                cat = 4; // Samsung SmartTag
            else if(cat == 0 && u.find("feaa") != std::string::npos)
                cat = 5; // Google Find My Device network (Pebblebee/Chipolo/Moto/Eufy)
            else if(cat == 0 &&
                    (u.find("fd44") != std::string::npos || u.find("fcb2") != std::string::npos))
                cat = BLE_TRACKER_CAT_AIRTAG; // Apple/DULT Find My accessory service
        }
        // AXON BODY-WORN CAMERA, by its own service-data tag rather than by a
        // MAC prefix. Checked before the Flock-OUI fallback below so a body cam
        // is never mislabelled as a camera: cat=7 is Axon, cat=1 is Flock, and
        // announcing one as the other is the over-claim the class enum exists to
        // prevent. Emitted as bwc=1 so the app can tell "Axon OUI" from "an Axon
        // body camera said so".
        // Same dangling-getPayload() trap as the Remote ID block below: search
        // the COPIED service-data and manufacturer-data strings instead.
        bool bwc = false;
        {
            int nsd = d.getServiceDataCount();
            for(int si = 0; si < nsd && !bwc; si++) {
                std::string sd = fstr(d.getServiceData(si));
                if(ble_str_has_bwc(sd)) bwc = true;
            }
            if(!bwc && d.haveManufacturerData()) {
                bwc = ble_str_has_bwc(fstr(d.getManufacturerData()));
            }
        }
        if(bwc) cat = 7;
        // Utility, Inc "BodyWorn" cameras name themselves in the advert. A NAME
        // tell, so it survives MAC randomisation the way the OUI table cannot.
        // Lands in the same body-worn class; the VENDOR is re-derived app-side
        // from the OUI, so a Utility unit on a Utility block reads "Utility
        // BodyWorn" and one on a randomised address reads the honest generic
        // "Body/in-car kit" rather than claiming Axon.
        if(cat == 0 && d.haveName()) {
            std::string nm = fstr(d.getName());
            if(nm.find("BodyWorn Remote") != std::string::npos) cat = 7;
        }

        if(cat == 0) {
            BLEAddress ba = d.getAddress();
            const uint8_t* nat = fble_addr_bytes(ba); // shape differs 2.x vs 3.x
            if(nat && oui_match(nat)) cat = 1; // Flock OUI on the BLE address
        }

