evanjs/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
        // Apple/Tile/Samsung/Google pairing adverts are what BLE-spam tools
        // (Flipper "BLE spam", ESP32 sour-apple, etc.) impersonate in bulk. A few
        // are normal; a flood of them in one scan is the spam signature.
        if(ble_tracker_category_is_known((uint8_t)cat)) spam++;

        // A distant tracker is still a BLE observation, but it cannot support
        // the anti-stalking inference. Do not send it across the wire where it
        // would consume a table slot or help a device clear the following gate.
        if(ble_tracker_category_is_known((uint8_t)cat) &&
           !ble_tracker_rssi_is_usable((int8_t)rssi)) {
            continue;
        }

        std::string a = fstr(d.getAddress().toString());
        char addr[13];
        int k = 0;
        for(size_t j = 0; j < a.size() && k < 12; j++) {
            if(a[j] != ':') addr[k++] = a[j];
        }
        addr[k] = 0;

        // REMOTE ID (ASTM F3411). Emitted as its own line, BEFORE the BLE line
        // and independently of `cat`, because an aircraft is not a Flock device
        // and must not be filed as one. The bytes go across verbatim as hex; all
        // decoding is app-side in helpers/open_drone_id.c.
        //
        // This is the only detection path that reaches the drones a US police
        // department actually flies. Checked against the IEEE registry
        // 2026-09-07: of Skydio, BRINC, Aerodome, Flock and Paladin, only Skydio
        // holds a block at all -- so for three of the five there is no MAC prefix
        // to match, ever. Remote ID is a legal broadcast mandate, so it works
        // regardless of vendor, and it carries the OPERATOR's position.
        //
        // USES THE PARSED SERVICE-DATA ACCESSORS, NOT getPayload().
        //
        // getPayload() looks like the obvious way to do this and is a TRAP:
        // BLEAdvertisedDevice::parseAdvertisement() stores `m_payload = payload`,
        // a bare POINTER into the ESP-IDF GAP event buffer, and never copies it.
        // We iterate results AFTER the scan has finished, by which time that
        // buffer is long gone -- so getPayload() is a dangling pointer and the
        // walk reads whatever now occupies that memory. Names and manufacturer
        // data survive only because those ARE copied into std::string members.
        // getServiceData(i) is likewise a real copy, so it stays valid here.
        //
        // Cost of learning that: the emitter transmitted a byte-perfect Remote ID
        // advert, the decoder parsed those exact captured bytes correctly in a
        // host test, and the drone still never appeared on the device.
        {
            int nsd = d.getServiceDataCount();
            for(int si = 0; si < nsd; si++) {
                std::string u = fstr(d.getServiceDataUUID(si).toString());
                // 16-bit 0xFFFA renders inside the full 128-bit form.
                if(u.find("fffa") == std::string::npos && u.find("FFFA") == std::string::npos) {
                    continue;
                }
                // The library strips the 2-byte UUID, so this already begins at
                // the ODID application code -- exactly what the app's decoder
                // expects to be handed.
                std::string sd = fstr(d.getServiceData(si));
                if(sd.size() < 2 || (uint8_t)sd[0] != 0x0D) continue;
                size_t sd_len = sd.size() > 64 ? 64 : sd.size();
                char rid[176];
                size_t rp = snprintf(rid, sizeof(rid), "RID,%s,%d,", addr, rssi);
                for(size_t k = 0; k < sd_len && rp + 2 < sizeof(rid); k++) {
                    buf_appendf(rid, sizeof(rid), &rp, "%02x", (uint8_t)sd[k]);
                }
                if(rp > sizeof(rid) - 1) rp = sizeof(rid) - 1;
                rid[rp++] = '\n';
                Serial.write((const uint8_t*)rid, rp);
                break;
            }
        }

        // One buffer + single write (same rationale as the D-line) so the multi-field
        // BLE line is emitted atomically.
        char line[176];
        size_t pos =
            snprintf(line, sizeof(line), "BLE,%s,%d,%d,%d,", addr, rssi, cat, company);
        if(d.haveName()) {
            std::string nm = fstr(d.getName());
            buf_append_escaped(line, sizeof(line), &pos, nm.c_str(), (int)nm.size(), 32);
        }
        // Trailing field: raw mfg-data hex for Flock (0x09C8) only, so the
        // Flipper can decode the device serial. Capped so the line stays well
        // under the Flipper's RX line limit; only Flock units carry it.
        // Widened from `company == 0x09C8` to ANY cat=1 device carrying
        // manufacturer data. A unit that reached cat=1 by Penguin naming, Raven
        // GATT or a Flock OUI while advertising under some other id previously
        // sent ZERO mfg bytes, so its serial could never be decoded and the app
        // had nothing to show.
        //
        // LINE BUDGET (char line[176], now the longest line the protocol emits):
        //   "BLE," 4 + addr 12 + "," + rssi <=4 + "," + cat 1 + "," + company <=6
        //   + ","                                              ~= 27
        //   escaped name, capped at 32 by buf_append_escaped, <=64 worst case
        //   "," + 62 hex chars (31-byte cap)                    = 63
        //   ",rv=1" 5 + ",sep=1" 6 + "\n" 1                     = 12
        //   -> 166 of 176. Fits, and buf_appendf clamps regardless.
        //
        // Wire shape is unchanged, so an older app still parses it: esp_parser.c
        // splits trailers on the presence of '=', and a foreign payload simply
        // lands in mfg[] and yields no serial. No ESP_PROTO_VERSION bump.
        if(cat == 1 && d.haveManufacturerData()) {
            std::string md = fstr(d.getManufacturerData());
            if(pos + 1 < sizeof(line)) line[pos++] = ',';
            for(size_t j = 0; j < md.length() && j < 31 && pos + 2 < sizeof(line); j++) {
                buf_appendf(line, sizeof(line), &pos, "%02x", (uint8_t)md[j]);
            }
        }
        // Raven GATT flag, emitted LAST so it follows the optional mfghex field.
        // The '=' lets the Flipper distinguish it from the pure-hex mfghex token.
        if(raven && pos + 5 < sizeof(line)) {
            memcpy(line + pos, ",rv=1", 5);
            pos += 5;
        }
        if(tracker_separated && pos + 6 < sizeof(line)) {
            memcpy(line + pos, ",sep=1", 6);
            pos += 6;
        }
        // Axon BWCDEVICE tag. Same '=' trailer convention as rv=/sep=, so an
        // older app ignores it rather than mis-parsing the line.
        if(bwc && pos + 6 < sizeof(line)) {
            memcpy(line + pos, ",bwc=1", 6);
            pos += 6;
        }
        if(pos > sizeof(line) - 1) pos = sizeof(line) - 1;
        line[pos++] = '\n';
        Serial.write((const uint8_t*)line, pos);
    }
    Serial.printf("BEND,%d\n", count);

    // A bulk of impersonation/pairing adverts in a single scan = a BLE-spam
    // flood (independent BLE radio class for the app's fused score).
    if(spam >= BLE_SPAM_MIN) Serial.printf("ATK,blespam,%d\n", spam);

    g_ble->clearResults();
    esp_wifi_set_promiscuous(true);
    set_channel(g_channel);
}

