evanjs/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
static void ble_action_ring(const char* wanted) {
    ble_ensure_init();
    esp_wifi_set_promiscuous(false);

    BLEAdvertisedDevice target;
    int category = 0;
    bool separated = false;
    int rssi = -127;
    if(!ble_action_find_target(wanted, &target, &category, &separated, &rssi)) {
        ble_action_emit("RING", "not_found", rssi, false);
        ble_action_restore_radio();
        return;
    }
    if(category != BLE_TRACKER_CAT_AIRTAG) {
        ble_action_emit("RING", "unsupported", rssi, true);
        ble_action_restore_radio();
        return;
    }
    if(!separated) {
        ble_action_emit("RING", "not_separated", rssi, true);
        ble_action_restore_radio();
        return;
    }

    BLEClient* client = ble_action_connect(&target);
    if(!client) {
        ble_action_emit("RING", "connect_fail", rssi, true);
        ble_action_restore_radio();
        return;
    }

    char status[16] = "unsupported";
    bool wrote = ble_ring_write_airtag(client, status);
    if(!wrote) wrote = ble_ring_write_dult(client->getService(DULT_NON_OWNER_SERVICE), status);
    if(!wrote) {
        // Some Find My accessories expose the older FD44 control point rather
        // than the DULT UUID. It is still a non-owner command, never owner auth.
        wrote = ble_ring_write_legacy(client, status);
    }
    client->disconnect();
    delete client;
    ble_action_emit("RING", wrote ? status : "service_missing", rssi, true);
    ble_action_restore_radio();
}

#else // FLOCK_HAS_BLE == 0

// Wi-Fi-only target (ESP32-S2 and friends). No Bluetooth radio exists, so these
// stand in as no-ops rather than missing symbols, which keeps loop() and the
// command dispatcher byte-identical across targets instead of threading #ifs
// through both. The ACT replies still ANSWER: a Flipper left waiting on a reply
// that can never arrive is worse than one told plainly the board cannot do it.
static void ble_do_scan(int seconds) {
    (void)seconds;
}
static void ble_locate_scan() {
}
static void ble_action_ping(const char* wanted) {
    (void)wanted;
    ble_action_emit("PING", "noble", -127, false);
}
static void ble_action_ring(const char* wanted) {
    (void)wanted;
    ble_action_emit("RING", "noble", -127, false);
}

#endif // FLOCK_HAS_BLE

// ---- optional GPS relay (FlipDeFlock issue #5) ---------------------------
//
// Some carrier boards wire a GPS module to the ESP32 instead of to the Flipper's
// header. The Flipper then cannot see it on ANY pin setting, because the NMEA
// never reaches its GPIO. When switched on, read the module here and relay the
// sentences the Flipper's parser understands as `G,<sentence>` lines.
//
// OFF unless the app asks for it (`gps <rx> [baud]`): Serial1's pins differ per
// board and per chip, so a wrong guess would just spray a dead pin's noise onto
// a link that carries detections.
//
// Deliberately NOT parsed here. The Flipper already has a host-tested NMEA
// parser used by its own UART path; relaying raw sentences means one parser, one
// set of lock-loss semantics, and no duplicated coordinate maths on the ESP.
#define GPS_LINE_MAX 100 // NMEA caps a sentence at 82 incl. CRLF; headroom
// Sized for the worst configured baud, not the common one. The app offers up to
// 115200, and a 10 Hz receiver at that rate emits on the order of 6 KB/s. loop()
// now drains between 1-second BLE slices rather than being stalled for a whole
// 3-second scan, so one slice is the window this has to cover: 8 KB gives
// headroom over that with room for a scheduling hiccup. It is ~3% of the free
// heap the sketch reports, which is a cheap way to make dropped sentences a
// non-event instead of a silent position error.
#define GPS_RX_BUF   8192

/* ---- which pins can carry a GPS on THIS chip -------------------------------
 *
 * Every bound below comes from the IDF's own per-target headers. Nothing here is
 * a hardcoded pin number, deliberately: the previous guard was
 * `rx > 0 && rx != 1 && rx != 3 && rx < 48`, which is the classic ESP32's
 * pinout written as if it were universal. On an ESP32-C5 that is wrong three
 * separate ways, and the failure modes get worse as they go:
 *
 *   - GPIO32..35 were offered by the app and do not exist (C5 stops at 28).
 *   - GPIO16..22 are the flash/PSRAM bus. A C5-WROOM-1-MDN8R8 has 8 MB of each,
 *     so they are genuinely occupied. This is what a user was told to use.
 *   - UART0 is GPIO11/12 on a C5, NOT 1/3. So the one thing the guard existed to
 *     prevent -- taking the link to the Flipper and cutting the board off, which
 *     needs a recovery flash to undo -- was exactly what it failed to prevent.
 *
 * Deriving the bounds from the SOC_, SPI_IOMUX_ and U0xxD_GPIO_NUM macros means
 * this is automatically correct on parts nobody here has ever held.
 */
// The contiguous span the flash bus occupies. Folding min..max over the six
// IOMUX pins rather than testing each one also covers the PSRAM lines, which
// share this bus on parts that have both and are not exposed as their own
// macros. All six exist on every target (verified against esp32/s2/s3/c3), and
// the span is contiguous on each: esp32 6-11, s2/s3 27-32, c3 12-17.
//
// constexpr, not nested ternary macros: the first attempt at this folded only
// five of the six and silently stopped the span at GPIO10, leaving the flash CS
// pin offered as a valid GPS input. The static_asserts below caught it.
static constexpr int flock_min_i(int a, int b) {
    return a < b ? a : b;
}
static constexpr int flock_max_i(int a, int b) {
    return a > b ? a : b;
}
// The flash-bus pin macros were RENAMED between IDF 4.x and 5.x: core 2.x calls
// them SPI_IOMUX_PIN_NUM_*, core 3.x calls the memory-SPI bus MSPI_IOMUX_PIN_NUM_*
// and reuses the bare SPI_ prefix for the general-purpose controllers. Building
// against only one spelling compiles on one core and fails on the other, which is
// exactly what the core-3.x compat job exists to catch -- and did.
#if defined(MSPI_IOMUX_PIN_NUM_CLK)
#define FLOCK_F_CLK  MSPI_IOMUX_PIN_NUM_CLK
#define FLOCK_F_MISO MSPI_IOMUX_PIN_NUM_MISO
#define FLOCK_F_MOSI MSPI_IOMUX_PIN_NUM_MOSI
#define FLOCK_F_HD   MSPI_IOMUX_PIN_NUM_HD
#define FLOCK_F_WP   MSPI_IOMUX_PIN_NUM_WP
// ...and the chip-select is CS0 on some core-3.x targets, bare CS on others.
#if defined(MSPI_IOMUX_PIN_NUM_CS0)
#define FLOCK_F_CS MSPI_IOMUX_PIN_NUM_CS0
#else
#define FLOCK_F_CS MSPI_IOMUX_PIN_NUM_CS
#endif
#elif defined(SPI_IOMUX_PIN_NUM_CLK)
#define FLOCK_F_CLK  SPI_IOMUX_PIN_NUM_CLK
#define FLOCK_F_MISO SPI_IOMUX_PIN_NUM_MISO
#define FLOCK_F_MOSI SPI_IOMUX_PIN_NUM_MOSI
#define FLOCK_F_HD   SPI_IOMUX_PIN_NUM_HD
#define FLOCK_F_WP   SPI_IOMUX_PIN_NUM_WP
#define FLOCK_F_CS   SPI_IOMUX_PIN_NUM_CS
#else
#error "No flash IOMUX pin macros for this IDF -- the GPS pin guard cannot be derived"
#endif

static constexpr int FLOCK_FLASH_LO = flock_min_i(
    flock_min_i(flock_min_i(FLOCK_F_CLK, FLOCK_F_MISO), FLOCK_F_MOSI),
    flock_min_i(flock_min_i(FLOCK_F_HD, FLOCK_F_WP), FLOCK_F_CS));
static constexpr int FLOCK_FLASH_HI = flock_max_i(
    flock_max_i(flock_max_i(FLOCK_F_CLK, FLOCK_F_MISO), FLOCK_F_MOSI),
    flock_max_i(flock_max_i(FLOCK_F_HD, FLOCK_F_WP), FLOCK_F_CS));

/* These pin down the two things above that are easy to get quietly wrong: that
 * the MIN5/MAX5 folding actually yields the flash span, and that the per-target
 * headers hold the values the datasheets say they do.
 *
 * The C5 block matters most, because NOBODY ON THIS PROJECT HAS A C5. Its
 * numbers come from Espressif's docs (GPIO0-28; UART0 on GPIO11/12; GPIO16-22
 * the flash/PSRAM bus) and are asserted here so CI, which does build the C5,
 * fails loudly if the research was wrong -- rather than shipping a guard that
 * refuses the wrong pins to the one person actually testing on that chip.
 */
#if defined(CONFIG_IDF_TARGET_ESP32)
static_assert(SOC_GPIO_PIN_COUNT == 40, "classic ESP32 has GPIO0-39");
static_assert(U0TXD_GPIO_NUM == 1 && U0RXD_GPIO_NUM == 3, "classic ESP32 UART0 is GPIO1/3");
static_assert(FLOCK_FLASH_LO == 6 && FLOCK_FLASH_HI == 11, "classic ESP32 flash is GPIO6-11");
#elif defined(CONFIG_IDF_TARGET_ESP32C5)
static_assert(SOC_GPIO_PIN_COUNT == 29, "ESP32-C5 has GPIO0-28");
static_assert(U0TXD_GPIO_NUM == 11 && U0RXD_GPIO_NUM == 12, "ESP32-C5 UART0 is GPIO11/12");
static_assert(FLOCK_FLASH_LO >= 16 && FLOCK_FLASH_HI <= 22, "ESP32-C5 flash/PSRAM is GPIO16-22");
#endif

/**
 * Why this pin cannot carry a GPS, or NULL if it can.
 * The string is echoed to the operator, because "refused" without "why" is what
 * made the last round of this take four attempts to diagnose.
 */
static const char* gps_pin_reject(int rx) {
    if(rx < 0 || rx >= SOC_GPIO_PIN_COUNT) return "no such pin on this chip";
    if(!((1ULL << rx) & SOC_GPIO_VALID_GPIO_MASK)) return "not a usable GPIO";
    if(rx == U0TXD_GPIO_NUM || rx == U0RXD_GPIO_NUM) return "carries the Flipper link";
    if(rx >= FLOCK_FLASH_LO && rx <= FLOCK_FLASH_HI) return "flash/PSRAM bus";
    return NULL;
}

/** Bitmask of pins gps_pin_reject() accepts. Sent to the app so its picker can
 *  offer this chip's real pins instead of a hardcoded classic-ESP32 list. */
static uint64_t gps_usable_mask() {
    uint64_t m = 0;
    for(int i = 0; i < SOC_GPIO_PIN_COUNT && i < 64; i++) {
        if(!gps_pin_reject(i)) m |= (1ULL << i);
    }
    return m;
}

static bool g_gps_on = false;
static int g_gps_rx = -1;
static uint32_t g_gps_baud = 9600;
static char g_gps_line[GPS_LINE_MAX];
static size_t g_gps_len = 0;

// Only the three sentence types the Flipper decodes (RMC / GGA / GLL). Filtering
// on this side keeps GSV/GSA/VTG chatter off a UART shared with detection lines
// -- a talkative receiver emits well over a dozen sentences per fix.
static bool gps_wanted(const char* s, size_t n) {
    if(n < 6 || s[0] != '$') return false;
    const char* t = s + 3; // '$' + 2-char talker (GP / GN / GL / GA / BD ...)
    return strncmp(t, "RMC", 3) == 0 || strncmp(t, "GGA", 3) == 0 || strncmp(t, "GLL", 3) == 0;
}

static void gps_relay_line() {
    if(!gps_wanted(g_gps_line, g_gps_len)) return;
    char out[GPS_LINE_MAX + 4];
    size_t pos = 0;
    out[pos++] = 'G';
    out[pos++] = ',';
    // Copy printable ASCII only. Commas and '$'/'*' MUST survive (they are the
    // sentence), so buf_append_escaped() is wrong here -- it maps ',' to '.'.
    // Anything outside printable ASCII is dropped rather than substituted: a
    // stray CR/LF would split the line and desync the Flipper's framing.
    for(size_t i = 0; i < g_gps_len && pos + 2 < sizeof(out); i++) {
        uint8_t c = (uint8_t)g_gps_line[i];
        if(c < 0x20 || c > 0x7E) continue;
        out[pos++] = (char)c;
    }
    out[pos++] = '\n';
    Serial.write((const uint8_t*)out, pos); // single write: atomic vs the WiFi task
}

static void gps_poll() {
    if(!g_gps_on) return;
    // Drain everything buffered, but emit at most ONE sentence of each type per
    // pass -- the newest.
    //
    // Only the current position matters, and the Flipper's parser ends up in the
    // same state either way: it applies sentences in order, so the last one wins.
    // Relaying a whole backlog instead would burn the Flipper's UART on
    // already-superseded fixes, competing with detection lines for the same link
    // at the exact moment a scan phase just ended and hits are being reported.
    //
    // Keeps the lock-loss semantics intact: "newest wins" is what the direct UART
    // path effectively does too, so a valid -> invalid transition still clears the
    // fix rather than being coalesced away.
    char last[3][GPS_LINE_MAX];
    size_t last_len[3] = {0, 0, 0};
    int budget = 4096; // generous: this runs once per pass, not per byte of link
    while(g_gps_on && Serial1.available() && budget-- > 0) {
        char c = (char)Serial1.read();
        if(c == '\n' || c == '\r') {
            if(g_gps_len && gps_wanted(g_gps_line, g_gps_len)) {
                // Bucket by sentence type so an RMC cannot displace a GGA: the
                // two carry different fields (course/validity vs satellites).
                const char* t = g_gps_line + 3;
                int slot = (strncmp(t, "RMC", 3) == 0) ? 0 : (strncmp(t, "GGA", 3) == 0) ? 1 : 2;
                memcpy(last[slot], g_gps_line, g_gps_len);
                last_len[slot] = g_gps_len;
            }
            g_gps_len = 0;
        } else if(g_gps_len + 1 < sizeof(g_gps_line)) {
            g_gps_line[g_gps_len++] = c;
        } else {
            // Overlong: drop the whole thing. Emitting a truncated sentence
            // would fail the Flipper's checksum check anyway, and a sentence
            // without its '*hh' could be parsed as a WRONG fix.
            g_gps_len = 0;
        }
    }
    // GGA first so the satellite count is in place before RMC's position/course.
    static const int order[3] = {1, 0, 2};
    for(int i = 0; i < 3; i++) {
        int slot = order[i];
        if(!last_len[slot]) continue;
        memcpy(g_gps_line, last[slot], last_len[slot]);
        g_gps_len = last_len[slot];
        gps_relay_line();
        g_gps_len = 0;
    }
}

// `gps off` | `gps <rx_pin> [baud]`. Echoes GPSCFG either way so a user hunting
// for their board's pin can confirm from a plain serial terminal. The Flipper
// ignores unknown lines, so the echo is safe on a live link.
static void gps_configure(int rx, uint32_t baud) {
    if(g_gps_on) {
        Serial1.end();
        g_gps_on = false;
    }
    g_gps_len = 0;
    if(rx >= 0) {
        g_gps_rx = rx;
        g_gps_baud = baud;
        Serial1.setRxBufferSize(GPS_RX_BUF);
        // RX only: we never talk to the receiver, so TX stays unassigned rather
        // than claiming a second pin the board may be using for something else.
        Serial1.begin(g_gps_baud, SERIAL_8N1, g_gps_rx, -1);
        g_gps_on = true;
    }
    Serial.printf("GPSCFG,%d,%d,%lu\n", g_gps_on ? 1 : 0, g_gps_rx, (unsigned long)g_gps_baud);
}

void setup() {
    Serial.begin(115200);
    // Short RX timeout so loop()'s readStringUntil('\n') can't stall channel-hop /
    // heartbeat for the default 1 s when a command arrives without a trailing newline.
    Serial.setTimeout(20);
    delay(200);

    nvs_flash_init();
    esp_event_loop_create_default();
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    esp_wifi_init(&cfg);
    esp_wifi_set_storage(WIFI_STORAGE_RAM);
    // WIFI_MODE_NULL is the classic-ESP32 idiom for a promiscuous sniffer and is
    // left exactly as it was on that target -- it is field-proven there and this
    // is not the place to experiment.
    //
    // CANDIDATE FIX FOR THE ESP32-S2, UNVERIFIED ON HARDWARE. Reported in issue
    // #25: an S2 (the official Flipper Wi-Fi Devboard v1) running the Wi-Fi-only
    // build comes up looking perfectly healthy -- banner fine, channel counting,
    // no errors -- and detects nothing at all across ten-plus minutes past
    // ten-plus cameras, on a board proven good because Marauder scans and logs on
    // it. A promiscuous RX callback that never fires produces exactly that
    // picture, and NULL-mode promiscuous is not guaranteed to deliver packets on
    // the S2 the way it does on the classic part. STA mode is the portable form.
    //
    // Gated to the S2 alone so the classic image is byte-identical and cannot
    // regress for anyone currently working. Nobody on this project has an S2, so
    // this ships as a nightly for the reporter to test, not as a release, and it
    // is a hypothesis until his diag.csv shows esp_frames climbing.
#if defined(CONFIG_IDF_TARGET_ESP32S2)
    esp_wifi_set_mode(WIFI_MODE_STA);
#else
    esp_wifi_set_mode(WIFI_MODE_NULL);
#endif
    esp_wifi_start();
#if FLOCK_HAS_5GHZ
    // AUTO = 2.4 + 5. Must be set before hopping: with the default 2.4-only mode
    // a 5 GHz set_channel() is rejected and the sweep silently covers half of
    // what it reports. Non-fatal if it fails -- hop_channel() still yields valid
    // 2.4 GHz channels, so the companion degrades to the classic behaviour
    // instead of scanning nothing.
    if(esp_wifi_set_band_mode(WIFI_BAND_MODE_AUTO) != ESP_OK) {
        g_band = FlockBand2G;
    }
#endif
    start_promisc();

    banner();
}

